RManager.data.res.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns1="urn:rm">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:transport>
   <ns1:header ns1:massage="">
   </ns1:header>
   <ns1:body>
    <ns1:relation>
     <ns1:node-id></ns1:node-id>
     <ns1:service-id></ns1:service-id>
     <ns1:relation-id>0</ns1:relation-id>
     <ns1:anonymous-method></ns1:anonymous-method>
     <ns1:privacy-lvl>0</ns1:privacy-lvl>
     <ns1:interval>0</ns1:interval>
    </ns1:relation>
    <ns1:relation>
     <ns1:node-id></ns1:node-id>
     <ns1:service-id></ns1:service-id>
     <ns1:relation-id>0</ns1:relation-id>
     <ns1:anonymous-method></ns1:anonymous-method>
     <ns1:privacy-lvl>0</ns1:privacy-lvl>
     <ns1:interval>0</ns1:interval>
    </ns1:relation>
   </ns1:body>
  </ns1:transport>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
